In [2]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

import warnings
warnings.filterwarnings('ignore')

In [4]:
df2 = pd.DataFrame({'a' : 1.,
                    'b' : pd.Timestamp('20130102'),
                    'c' : pd.Series(1, index=list(range(4)), dtype='float32'),
                    'd' : np.array([3] * 4, dtype = 'int32'),
                    'e' : pd.Categorical(['test', 'train', 'test', 'train']),
                    'f' : 'foo'})

In [5]:
df2

     a          b    c  d      e    f
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

a           float64
b    datetime64[ns]
c           float32
d             int32
e          category
f            object
dtype: object

In [8]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [9]:
df2.columns

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [10]:
df2.head()

     a          b    c  d      e    f
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [18]:
df3 = pd.DataFrame(pd.Timestamp('20200102'), index = 1)

ValueError: DataFrame constructor not properly called!

In [19]:
pd.Timestamp('20200102')

Timestamp('2020-01-02 00:00:00')

In [26]:
df3 = pd.DataFrame(columns = ['a'], index=[1,2,3])

In [27]:
df3

     a
1  NaN
2  NaN
3  NaN

In [32]:
df3['a'] = pd.Timestamp('20200101')

In [47]:
df3.loc[1,'a'] = pd.Timestamp('20200101')
df3.loc[2,'a'] = pd.Timestamp('20200102')
df3.loc[3,'a'] = pd.Timestamp('20200103')

In [48]:
df4 = pd.DataFrame(index=[1,2,3], columns=['a'])
for i in range(1,4):
    df4.loc[i, 'a'] = pd.Timestamp('2020010'+str(i))

In [49]:
df4

                     a
1  2020-01-01 00:00:00
2  2020-01-02 00:00:00
3  2020-01-03 00:00:00

In [50]:
df4.T

           1          2          3
a 2020-01-01 2020-01-02 2020-01-03

In [51]:
df4.sort_index(axis=1, ascending=False)

                     a
1  2020-01-01 00:00:00
2  2020-01-02 00:00:00
3  2020-01-03 00:00:00

In [52]:
df2

     a          b    c  d      e    f
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [55]:
df2 = pd.DataFrame({'d' : 1.,
                    'c' : pd.Timestamp('20130102'),
                    'a' : pd.Series(1, index=list(range(4)), dtype='float32'),
                    'k' : np.array([3] * 4, dtype = 'int32'),
                    'e' : pd.Categorical(['test', 'train', 'test', 'train']),
                    'f' : 'foo'})

In [56]:
df2.head()

     d          c    a  k      e    f
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [59]:
df2.sort_index(axis=1)

     a          c    d      e    f  k
0  1.0 2013-01-02  1.0   test  foo  3
1  1.0 2013-01-02  1.0  train  foo  3
2  1.0 2013-01-02  1.0   test  foo  3
3  1.0 2013-01-02  1.0  train  foo  3

In [60]:
df2.sort_index(axis=1, ascending=False)

   k    f      e    d          c    a
0  3  foo   test  1.0 2013-01-02  1.0
1  3  foo  train  1.0 2013-01-02  1.0
2  3  foo   test  1.0 2013-01-02  1.0
3  3  foo  train  1.0 2013-01-02  1.0

In [61]:

for i in range(1,4):
    df2.loc[i,'k'] = i+2

In [63]:
df2

     d          c    a  k      e    f
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  4   test  foo
3  1.0 2013-01-02  1.0  5  train  foo

In [66]:
df2.sort_values(by='k', ascending=False)

     d          c    a  k      e    f
3  1.0 2013-01-02  1.0  5  train  foo
2  1.0 2013-01-02  1.0  4   test  foo
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo

In [67]:
df2

     d          c    a  k      e    f
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  4   test  foo
3  1.0 2013-01-02  1.0  5  train  foo

In [68]:
df2.loc[dates[0]]

NameError: name 'dates' is not defined

In [69]:
df2.loc[:,['c','a']]

           c    a
0 2013-01-02  1.0
1 2013-01-02  1.0
2 2013-01-02  1.0
3 2013-01-02  1.0

In [70]:
df2

     d          c    a  k      e    f
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  4   test  foo
3  1.0 2013-01-02  1.0  5  train  foo

In [71]:
df_copy = df2.copy()

In [72]:
df_copy

     d          c    a  k      e    f
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  4   test  foo
3  1.0 2013-01-02  1.0  5  train  foo

In [75]:
df2[df2['e'].isin(['test'])]

     d          c    a  k     e    f
0  1.0 2013-01-02  1.0  3  test  foo
2  1.0 2013-01-02  1.0  4  test  foo

In [78]:
df2[df2['e'].isin(['test'])]

     d          c    a  k     e    f
0  1.0 2013-01-02  1.0  3  test  foo
2  1.0 2013-01-02  1.0  4  test  foo

In [81]:
df2['e'].isin(['test'])

0     True
1    False
2     True
3    False
Name: e, dtype: bool

In [84]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [85]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [93]:
s2 = pd.Series(index=[1,2,3,4,5,6], data = pd.date_range('20150305', periods=6))

In [88]:
s2

1   2015-03-05
2   2015-03-06
3   2015-03-07
4   2015-03-08
5   2015-03-09
6   2015-03-10
dtype: datetime64[ns]

In [98]:
pd.date_range('20150305', '20150405', periods=6)

DatetimeIndex(['2015-03-05 00:00:00', '2015-03-11 04:48:00',
               '2015-03-17 09:36:00', '2015-03-23 14:24:00',
               '2015-03-29 19:12:00', '2015-04-05 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [100]:
df2['f'] = s1

In [101]:
df2

     d          c    a  k      e   f
0  1.0 2013-01-02  1.0  3   test NaN
1  1.0 2013-01-02  1.0  3  train NaN
2  1.0 2013-01-02  1.0  4   test NaN
3  1.0 2013-01-02  1.0  5  train NaN

In [ ]:
df.loc[:,'d']

In [103]:
np.arange(3)

array([0, 1, 2])

In [109]:
np.array([5] * len(df2))

array([5, 5, 5, 5])

In [111]:
len(df2)

4

In [112]:
df2

     d          c    a  k      e   f
0  1.0 2013-01-02  1.0  3   test NaN
1  1.0 2013-01-02  1.0  3  train NaN
2  1.0 2013-01-02  1.0  4   test NaN
3  1.0 2013-01-02  1.0  5  train NaN

In [113]:
df2.shape

(4, 6)

In [115]:
df2

     d          c    a  k      e   f
0  1.0 2013-01-02  1.0  3   test NaN
1  1.0 2013-01-02  1.0  3  train NaN
2  1.0 2013-01-02  1.0  4   test NaN
3  1.0 2013-01-02  1.0  5  train NaN

In [116]:
df2[df2 > 0] = -df2

TypeError: bad operand type for unary -: 'Timestamp'

In [120]:
df2['k'][df2['k'] > 0] = -df2['k']

In [121]:
df2

     d          c    a  k      e   f
0  1.0 2013-01-02  1.0 -3   test NaN
1  1.0 2013-01-02  1.0 -3  train NaN
2  1.0 2013-01-02  1.0 -4   test NaN
3  1.0 2013-01-02  1.0 -5  train NaN

In [124]:
s1['b'] = [11,12,13,14,15,16,]

In [125]:
s1

2013-01-02 00:00:00                           1
2013-01-03 00:00:00                           2
2013-01-04 00:00:00                           3
2013-01-05 00:00:00                           4
2013-01-06 00:00:00                           5
2013-01-07 00:00:00                           6
b                      [11, 12, 13, 14, 15, 16]
dtype: object

In [127]:
ss1 = pd.DataFrame({'a': [1,2,3,4],
                    'b' : pd.date_range('20200101', '20200109', periods=4),
                    'c' : [11,12,13,14]})

In [131]:
ss1.set_index('b', inplace=True)

In [132]:
ss1

                     a   c
b
2020-01-01 00:00:00  1  11
2020-01-03 16:00:00  2  12
2020-01-06 08:00:00  3  13
2020-01-09 00:00:00  4  14

In [133]:
ss1.loc[dates[0]]

NameError: name 'dates' is not defined

In [134]:
ss2 = ss1.copy()

In [135]:
ss2 = ss1.reindex()

In [136]:
ss2

                     a   c
b
2020-01-01 00:00:00  1  11
2020-01-03 16:00:00  2  12
2020-01-06 08:00:00  3  13
2020-01-09 00:00:00  4  14

In [139]:
df2.loc[1, 'f'] = 2

In [140]:
df2

     d          c    a  k      e    f
0  1.0 2013-01-02  1.0 -3   test  NaN
1  1.0 2013-01-02  1.0 -3  train  2.0
2  1.0 2013-01-02  1.0 -4   test  NaN
3  1.0 2013-01-02  1.0 -5  train  NaN

In [141]:
df2

     d          c    a  k      e    f
0  1.0 2013-01-02  1.0 -3   test  NaN
1  1.0 2013-01-02  1.0 -3  train  2.0
2  1.0 2013-01-02  1.0 -4   test  NaN
3  1.0 2013-01-02  1.0 -5  train  NaN

In [144]:
df2

     d          c    a  k      e    f
0  1.0 2013-01-02  1.0 -3   test  NaN
1  1.0 2013-01-02  1.0 -3  train  2.0
2  1.0 2013-01-02  1.0 -4   test  NaN
3  1.0 2013-01-02  1.0 -5  train  NaN

In [145]:
df2['g'] = np.NaN

In [146]:
df2

     d          c    a  k      e    f   g
0  1.0 2013-01-02  1.0 -3   test  NaN NaN
1  1.0 2013-01-02  1.0 -3  train  2.0 NaN
2  1.0 2013-01-02  1.0 -4   test  NaN NaN
3  1.0 2013-01-02  1.0 -5  train  NaN NaN

In [147]:
df2.loc[2, 'g'] = 3

In [148]:
df2

     d          c    a  k      e    f    g
0  1.0 2013-01-02  1.0 -3   test  NaN  NaN
1  1.0 2013-01-02  1.0 -3  train  2.0  NaN
2  1.0 2013-01-02  1.0 -4   test  NaN  3.0
3  1.0 2013-01-02  1.0 -5  train  NaN  NaN

In [153]:
df2.dropna(subset=['g'])

     d          c    a  k     e   f    g
2  1.0 2013-01-02  1.0 -4  test NaN  3.0

In [154]:
df2.dropna(subset=['f'])

     d          c    a  k      e    f   g
1  1.0 2013-01-02  1.0 -3  train  2.0 NaN

In [156]:
df2.dropna(how='any')

Empty DataFrame
Columns: [d, c, a, k, e, f, g]
Index: []

In [157]:
df2.dropna(how='all')

     d          c    a  k      e    f    g
0  1.0 2013-01-02  1.0 -3   test  NaN  NaN
1  1.0 2013-01-02  1.0 -3  train  2.0  NaN
2  1.0 2013-01-02  1.0 -4   test  NaN  3.0
3  1.0 2013-01-02  1.0 -5  train  NaN  NaN

In [158]:
df3 = df2.copy()

In [161]:
df3

     d          c    a  k      e    f    g
0  1.0 2013-01-02  1.0 -3   test  NaN  NaN
1  1.0 2013-01-02  1.0 -3  train  2.0  NaN
2  1.0 2013-01-02  1.0 -4   test  NaN  3.0
3  1.0 2013-01-02  1.0 -5  train  NaN  NaN

In [166]:
df3['f'].fillna(5)

0    5.0
1    2.0
2    5.0
3    5.0
Name: f, dtype: float64

In [165]:
df3

     d          c    a  k      e    f    g
0  1.0 2013-01-02  1.0 -3   test  NaN  NaN
1  1.0 2013-01-02  1.0 -3  train  2.0  NaN
2  1.0 2013-01-02  1.0 -4   test  NaN  3.0
3  1.0 2013-01-02  1.0 -5  train  NaN  NaN

In [167]:
df3

     d          c    a  k      e    f    g
0  1.0 2013-01-02  1.0 -3   test  NaN  NaN
1  1.0 2013-01-02  1.0 -3  train  2.0  NaN
2  1.0 2013-01-02  1.0 -4   test  NaN  3.0
3  1.0 2013-01-02  1.0 -5  train  NaN  NaN

In [172]:
df3.mean()

d    1.00
a    1.00
k   -3.75
f    2.00
g    3.00
dtype: float64